Configuration/Диплом/src/Documents/ВКМ_ВыплатаЗарплаты/ВКМ_ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатаЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Выплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Configuration/Диплом/src/Documents/ВКМ_ВыплатаЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий      

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СформироватьДвижения(); 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижения()  
                                   
	Для Каждого Строка Из Выплаты Цикл
		ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Расход;   
		ДвижениеВзаиморасчеты.Сотрудник = Строка.Сотрудник;
		ДвижениеВзаиморасчеты.Сумма = Строка.Сумма;
		ДвижениеВзаиморасчеты.Период = Дата;
	КонецЦикла;

	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();

КонецПроцедуры 

#КонецОбласти

#КонецЕсли
